# regex

In [37]:
import re

word='\w+'
sentence='There is my sentence.'

In [24]:
re.findall(word,sentence)

['Here', 'is', 'my', 'sentence']

In [32]:
search_result=re.search(word,sentence)
search_result
#search method allows us to search for a match throughout the string.
#if a match is found, a match object is returned.

In [33]:
search_result.group()
#group method returned the matched string

'There'

In [36]:
match_result=re.match(word,sentence)
match_result.group()
# match method searches only from the beginning of the string.

'There'

In [42]:
number='\d+'
capitalized_word='[A-Z]\w+'
sentence='I have 2 pets: Bear and Bunny'

search_number=re.search(number,sentence)
print(search_number.group())

match_number=re.match(number,sentence)
#print(match_number.group())

search_capital=re.search(capitalized_word,sentence)
print(search_capital.group())

match_capital=re.match(capitalized_word,sentence)
print(match_capital.group())

2
Bear

AttributeError: 'NoneType' object has no attribute 'group'

# Data Exploration

In [46]:
import xlrd
import agate

In [50]:
workbook=xlrd.open_workbook('unicef_oct_2014.xls')
workbook.nsheets
workbook.sheet_names()

['Child labour  ']

In [51]:
sheet=workbook.sheets()[0]
sheet.nrows

134

In [52]:
sheet.row_values(0)

['UNICEF global databases', '', '', '', '', '', '', '', '', '', '', '', '', '']

In [54]:
for r in range(sheet.nrows):
    print (r,sheet.row(r))

0 [text:'UNICEF global databases', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'']
1 [text:'Child labour', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'']
2 [text:'Updated November 2014', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'']
3 [empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'', empty:'']
4 [empty:'', text:'Total (%)', empty:'', text:'Sex (%)', empty:'', text:'Place of residence (%)', empty:'', text:'Household wealth quintile (%)', empty:'', empty:'', empty:'', empty:'', text:'Reference Year', text:'Data Source']
5 [text:'Countries and areas', empty:'', empty:'', text:'Male', text:'Female', text:'Urban', text:'Rural', text:'Poorest', text:'Second', text:'Middle', text:'Fourth', text:'Richest', empty:'', empty:'']
6 [text:'Afghanistan', number:10.3, empty:'', number:11.0, number:9.6, number:7.9, number:10.8, number:11.9, number:11.8, number:10.1, number:9.7, number:7.8, text:'2010-2011', text:'MICS']
7 [text:'Albania', number:5.1, text:'y', number:6.2, number:3.9, text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2010.0, text:'National Child Labour Survey']
8 [text:'Algeria', number:4.7, text:'y', number:5.5, number:3.9, number:3.9, number:5.6, number:7.3, number:4.5, number:4.1, number:3.1, number:3.8, number:2006.0, text:'MICS']
9 [text:'Angola', number:23.5, empty:'', number:22.1, number:24.8, text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2001.0, text:'MICS']
10 [text:'Argentina', number:4.4, empty:'', number:4.8, number:3.9, text:'-', text:'-', number:6.8, number:3.9, number:3.3, number:3.7, number:3.1, text:'2011/2012', text:'MICS']
11 [text:'Armenia', number:3.9, empty:'', number:4.7, number:2.9, number:2.4, number:6.0, number:6.9, number:4.1, number:3.2, number:2.4, number:2.4, number:2010.0, text:'ARM_DHS _2010']
12 [text:'Azerbaijan', number:6.5, text:'y', number:7.5, number:5.4, number:2.1, number:10.7, text:'-', text:'-', text:'-', text:'-', text:'-', number:2005.0, text:'Dayioglu, Meltem. 2007. Working children in Azerbaijan: An analysis of the 2005 child labour and labouring children surveys. State Statistical Committee of Azerbaijan and ILO']
13 [text:'Bahrain', number:4.6, empty:'', number:6.3, number:3.0, text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2000.0, text:'MICS']
14 [text:'Bangladesh', number:12.8, empty:'', number:17.5, number:8.1, number:11.2, number:13.4, number:16.0, number:14.7, number:13.0, number:10.5, number:8.2, number:2006.0, text:'MICS']
15 [text:'Belarus', number:1.4, empty:'', number:1.4, number:1.5, number:1.3, number:1.8, number:1.0, number:2.4, number:1.2, number:1.7, number:1.0, number:2012.0, text:'MICS']
16 [text:'Belize', number:5.8, empty:'', number:6.7, number:5.0, number:3.2, number:7.4, number:8.4, number:8.4, number:4.9, number:2.8, number:3.1, number:2011.0, text:'MICS']
17 [text:'Benin', number:15.3, empty:'', number:14.9, number:15.6, number:10.5, number:18.1, number:19.6, number:19.9, number:16.8, number:10.9, number:6.0, text:'2011-2012', text:'DHS']
18 [text:'Bhutan', number:2.9, empty:'', number:2.6, number:3.1, number:1.7, number:3.3, number:4.5, number:3.2, number:2.2, number:2.4, number:2.2, number:2010.0, text:'MICS']
19 [text:'Bolivia (Plurinational State of)', number:26.4, text:'y', number:28.2, number:24.4, number:15.1, number:64.6, text:'-', text:'-', text:'-', text:'-', text:'-', number:2008.0, text:'ETI']
20 [text:'Bosnia and Herzegovina', number:5.3, empty:'', number:6.6, number:3.9, number:3.2, number:6.4, number:4.5, number:11.1, number:5.0, number:2.8, number:3.6, number:2006.0, text:'MICS']
21 [text:'Botswana', number:9.0, text:'y', number:10.9, number:7.0, number:11.3, number:12.6, text:'-', text:'-', text:'-', text:'-', text:'-', text:'2005-2006', text:'Botswana Labour Force Survey']
22 [text:'Brazil', number:8.3, text:'y', number:10.6, number:6.0, text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2012.0, text:'IBGE PNAD']
23 [text:'Burkina Faso', number:39.2, empty:'', number:42.3, number:36.0, number:17.3, number:44.0, number:48.0, number:44.6, number:42.5, number:37.9, number:18.1, number:2010.0, text:'DHS']
24 [text:'Burundi', number:26.3, empty:'', number:25.5, number:27.1, number:14.5, number:27.4, number:26.8, number:28.0, number:28.4, number:26.8, number:21.1, number:2010.0, text:'DHS']
25 [text:'Cabo Verde', number:6.4, text:'y', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2012.0, text:'Inquerito Multi-Objectivo Continuo (prelim)']
26 [text:'Cambodia', number:18.3, text:'y', number:19.2, number:17.4, text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2013.0, text:'CSES']
27 [text:'Cameroon', number:41.7, empty:'', number:43.1, number:40.2, number:27.2, number:52.8, number:55.9, number:52.9, number:42.5, number:31.9, number:17.6, number:2011.0, text:'DHS']
28 [text:'Central African Republic', number:28.5, empty:'', number:27.2, number:29.9, number:21.2, number:33.0, number:35.8, number:36.0, number:32.2, number:21.8, number:17.0, number:2010.0, text:'MICS']
29 [text:'Chad', number:26.1, empty:'', number:24.5, number:27.8, number:23.6, number:26.8, number:27.0, number:26.1, number:28.4, number:27.2, number:21.5, number:2010.0, text:'MICS']
30 [text:'Chile', number:6.6, text:'y', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2012.0, text:'EANNA']
31 [text:'Colombia', number:9.7, text:'y', number:12.5, number:6.6, number:7.4, number:15.8, text:'-', text:'-', text:'-', text:'-', text:'-', number:2013.0, text:'ENTI']
32 [text:'Comoros', number:22.0, empty:'', number:20.2, number:23.8, number:16.5, number:24.3, number:29.6, number:25.1, number:20.8, number:18.4, number:10.8, number:2012.0, text:'DHS']
33 [text:'Congo', number:18.4, empty:'', number:17.7, number:19.0, number:13.5, number:25.7, number:29.1, number:21.9, number:13.4, number:15.9, number:9.5, text:'2011-2012', text:'DHS']
34 [text:'Costa Rica', number:4.1, empty:'', number:3.5, number:4.6, number:4.0, number:4.2, number:6.2, number:3.0, number:2.2, number:4.7, number:3.6, number:2011.0, text:'MICS']
35 [text:"Côte d'Ivoire", number:26.4, empty:'', number:25.4, number:27.5, number:15.6, number:33.9, number:36.9, number:30.2, number:30.3, number:20.4, number:12.5, text:'2011-2012', text:'DHS']
36 [text:'Democratic Republic of the Congo', number:15.0, empty:'', number:13.1, number:16.8, number:10.3, number:16.9, number:16.3, number:16.2, number:15.9, number:16.9, number:9.2, number:2010.0, text:'MICS']
37 [text:'Djibouti', number:7.7, empty:'', number:7.6, number:7.7, number:7.6, number:9.7, text:'-', text:'-', text:'-', text:'-', text:'-', number:2006.0, text:'MICS']
38 [text:'Dominican Republic', number:12.9, empty:'', number:17.5, number:7.9, number:10.6, number:17.1, number:18.5, number:17.6, number:10.4, number:10.1, number:5.1, text:'2009-2010', text:'ENHOGAR']
39 [text:'Ecuador', number:8.6, text:'y', text:'-', text:'-', number:4.3, number:15.5, text:'-', text:'-', text:'-', text:'-', text:'-', number:2012.0, text:'ENTI']
40 [text:'Egypt', number:9.3, text:'y', number:14.3, number:4.0, text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2010.0, text:'National Child Labour Survey']
41 [text:'El Salvador', number:8.5, text:'y', number:12.7, number:4.2, number:5.7, number:12.4, number:8.2, number:6.7, number:8.1, number:9.9, number:9.3, number:2013.0, text:'EHPM']
42 [text:'Equatorial Guinea', number:27.8, empty:'', number:27.9, number:27.6, text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2000.0, text:'MICS']
43 [text:'Ethiopia', number:27.4, empty:'', number:31.1, number:23.5, number:13.3, number:29.7, number:31.3, number:30.8, number:30.2, number:27.0, number:14.7, number:2011.0, text:'DHS']
44 [text:'Gabon', number:13.4, empty:'', number:15.4, number:11.6, number:11.0, number:26.6, number:26.4, number:12.5, number:12.3, number:7.9, number:7.5, number:2012.0, text:'DHS']
45 [text:'Gambia', number:19.2, empty:'', number:20.9, number:17.5, number:9.5, number:26.0, number:28.1, number:20.7, number:18.8, number:16.6, number:8.6, number:2010.0, text:'MICS']
46 [text:'Georgia', number:18.4, empty:'', number:20.0, number:16.6, number:16.1, number:20.4, number:17.8, number:21.5, number:19.7, number:17.8, number:15.0, number:2005.0, text:'MICS']
47 [text:'Ghana', number:33.9, empty:'', number:33.8, number:34.0, number:19.7, number:42.5, number:47.9, number:46.1, number:30.8, number:24.0, number:13.7, number:2006.0, text:'MICS']
48 [text:'Guatemala', number:25.8, text:'y', number:35.1, number:16.1, number:20.7, number:32.6, text:'-', text:'-', text:'-', text:'-', text:'-', number:2012.0, text:'ENEI']
49 [text:'Guinea', number:28.3, empty:'', number:29.2, number:27.4, number:11.9, number:35.2, number:40.0, number:34.3, number:32.3, number:22.6, number:8.8, number:2012.0, text:'DHS']
50 [text:'Guinea-Bissau', number:38.0, empty:'', number:39.5, number:36.4, number:23.0, number:47.6, number:50.7, number:48.7, number:41.7, number:23.4, number:15.4, number:2010.0, text:'MICS']
51 [text:'Guyana', number:16.4, empty:'', number:17.3, number:15.5, number:9.0, number:19.0, number:29.4, number:17.3, number:13.1, number:11.5, number:3.9, number:2006.0, text:'MICS']
52 [text:'Haiti', number:24.4, empty:'', number:24.5, number:24.3, number:15.8, number:29.2, number:33.7, number:29.9, number:23.8, number:18.5, number:10.6, number:2012.0, text:'DHS']
53 [text:'Honduras', number:14.0, text:'y', number:22.1, number:5.9, number:9.1, number:17.1, text:'-', text:'-', text:'-', text:'-', text:'-', number:2013.0, text:'Encuesta Permanente de Hogares de Propositos Multiples, UCW calculations']
54 [text:'India', number:11.8, empty:'', number:11.6, number:11.9, number:8.6, number:12.9, number:14.2, number:14.0, number:12.2, number:9.3, number:6.4, text:'2005-2006', text:'NFHS']
55 [text:'Indonesia', number:6.9, text:'y', number:7.9, number:5.8, text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2009.0, text:' Indonesia Child Labour Survey']
56 [text:'Iran (Islamic Republic of)', number:11.4, text:'y', number:12.5, number:10.2, number:9.5, number:15.0, text:'-', text:'-', text:'-', text:'-', text:'-', number:2010.0, text:'MIDHS']
57 [text:'Iraq', number:4.7, empty:'', number:5.4, number:4.0, number:3.3, number:7.6, number:7.9, number:5.0, number:3.7, number:3.8, number:1.8, number:2011.0, text:'MICS']
58 [text:'Jamaica', number:3.3, empty:'', number:3.5, number:3.2, number:3.9, number:2.7, number:4.4, number:4.7, number:2.2, number:3.1, number:1.6, number:2011.0, text:'MICS']
59 [text:'Jordan', number:1.6, text:'y', number:2.8, number:0.3, text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2007.0, text:'Child Labour Survey']
60 [text:'Kazakhstan', number:2.2, empty:'', number:2.4, number:2.1, number:2.5, number:1.9, number:1.8, number:2.1, number:2.8, number:2.4, number:2.2, number:2006.0, text:'MICS']
61 [text:'Kenya', number:25.9, empty:'', number:26.5, number:25.2, text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2000.0, text:'MICS']
62 [text:'Kyrgyzstan', number:3.6, empty:'', number:4.3, number:2.9, number:1.9, number:4.5, number:1.9, number:3.7, number:4.7, number:5.0, number:2.8, number:2006.0, text:'MICS']
63 [text:"Lao People's Democratic Republic", number:10.1, text:'y', number:9.0, number:11.2, text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2010.0, text:'National Child Labour Survey ']
64 [text:'Lebanon', number:1.9, empty:'', number:2.7, number:0.9, text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2009.0, text:'MICS']
65 [text:'Lesotho', number:22.9, empty:'', number:25.0, number:20.7, text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2000.0, text:'MICS']
66 [text:'Liberia', number:20.8, empty:'', number:21.1, number:20.5, number:15.7, number:24.0, number:26.9, number:25.3, number:21.2, number:18.4, number:13.5, number:2007.0, text:'DHS']
67 [text:'Madagascar', number:22.9, text:'y', number:23.2, number:22.6, number:15.2, number:24.6, number:27.0, number:25.9, number:23.6, number:20.8, number:13.4, text:'2012-2013', text:'ENSOMD']
68 [text:'Malawi', number:25.7, empty:'', number:25.3, number:26.2, number:13.9, number:27.7, number:26.3, number:29.8, number:29.3, number:26.2, number:18.0, number:2006.0, text:'MICS']
69 [text:'Mali', number:21.4, empty:'', number:22.0, number:20.7, number:17.7, number:22.6, number:21.1, number:23.5, number:22.8, number:21.4, number:17.2, number:2010.0, text:'MICS']
70 [text:'Mauritania', number:14.6, empty:'', number:14.3, number:14.9, number:7.5, number:16.6, number:25.3, number:18.3, number:10.9, number:8.6, number:4.8, number:2011.0, text:'MICS']
71 [text:'Mexico', number:6.3, text:'y', number:7.3, number:5.3, number:5.1, number:8.0, text:'-', text:'-', text:'-', text:'-', text:'-', number:2011.0, text:'Modulo de Trabajo Infantil de la ENOE']
72 [text:'Mongolia', number:10.4, empty:'', number:10.3, number:10.6, number:8.8, number:16.0, number:14.9, number:11.9, number:11.4, number:8.8, number:3.1, number:2010.0, text:'MICS']
73 [text:'Montenegro', number:9.9, empty:'', number:11.7, number:7.8, number:5.5, number:16.5, number:23.7, number:8.7, number:4.8, number:6.4, number:3.2, number:2005.0, text:'MICS']
74 [text:'Morocco', number:8.3, empty:'', number:9.1, number:7.5, number:3.5, number:13.3, number:17.7, number:9.6, number:5.0, number:3.2, number:1.9, text:'2006-2007', text:'ENIMSJ']
75 [text:'Mozambique', number:22.2, empty:'', number:20.5, number:23.8, number:15.1, number:25.3, number:24.0, number:22.8, number:25.4, number:23.6, number:14.3, number:2008.0, text:'MICS']
76 [text:'Nepal', number:33.9, text:'y', number:30.2, number:37.8, number:14.4, number:36.7, text:'-', text:'-', text:'-', text:'-', text:'-', number:2008.0, text:'Nepal Labour Force Survey']
77 [text:'Nicaragua', number:14.5, empty:'', number:17.6, number:11.2, text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2001.0, text:'DHS']
78 [text:'Niger', number:30.5, empty:'', number:30.8, number:30.1, number:18.1, number:32.6, number:28.8, number:33.3, number:32.9, number:33.6, number:23.0, number:2012.0, text:'DHS']
79 [text:'Nigeria', number:24.7, empty:'', number:24.1, number:25.3, number:18.7, number:27.6, number:28.5, number:28.2, number:25.3, number:22.3, number:17.8, number:2011.0, text:'MICS']
80 [text:'Panama', number:5.6, text:'y', number:8.0, number:3.0, number:2.5, number:8.6, text:'-', text:'-', text:'-', text:'-', text:'-', number:2012.0, text:'ETI']
81 [text:'Paraguay', number:27.6, text:'y', number:31.8, number:23.5, number:20.2, number:36.7, number:29.6, number:29.0, number:28.5, number:25.1, number:23.7, number:2011.0, text:'EANA']
82 [text:'Peru', number:33.5, text:'y', number:30.6, number:36.3, number:18.2, number:60.9, text:'-', text:'-', text:'-', text:'-', text:'-', number:2007.0, text:'ESTI']
83 [text:'Philippines', number:11.1, text:'y', number:14.1, number:7.9, text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2011.0, text:'Survey on Children (prelim)']
84 [text:'Portugal', number:3.4, text:'y', number:4.2, number:2.5, text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2001.0, text:'Labour Force Survey, UCW calculations']
85 [text:'Republic of Moldova', number:16.3, empty:'', number:20.2, number:12.3, text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2009.0, text:"Children''s Activities Survey"]
86 [text:'Romania', number:0.9, empty:'', number:1.2, number:0.7, text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2000.0, text:'Household Labour Force Survey, UCW calculations']
87 [text:'Rwanda', number:28.5, empty:'', number:26.7, number:30.4, number:18.7, number:29.8, number:33.3, number:30.9, number:29.4, number:29.4, number:18.3, number:2010.0, text:'DHS']
88 [text:'Saint Lucia', number:3.9, empty:'', number:4.9, number:2.9, number:3.8, number:3.9, text:'-', text:'-', text:'-', text:'-', text:'-', number:2012.0, text:'MICS']
89 [text:'Sao Tome and Principe', number:7.5, empty:'', number:7.7, number:7.2, number:5.7, number:9.7, number:8.3, number:9.4, number:8.8, number:6.7, number:3.9, number:2006.0, text:'MICS']
90 [text:'Senegal', number:14.5, empty:'', number:19.0, number:10.0, number:5.1, number:19.8, number:29.7, number:18.8, number:8.8, number:6.3, number:4.5, text:'2012-2013', text:'Continuous DHS']
91 [text:'Serbia', number:4.4, empty:'', number:4.5, number:4.4, number:3.3, number:5.7, number:8.4, number:5.5, number:2.9, number:2.7, number:2.6, number:2005.0, text:'MICS']
92 [text:'Sierra Leone', number:26.0, empty:'', number:27.0, number:25.0, number:18.2, number:29.3, number:29.4, number:32.7, number:30.8, number:24.3, number:11.3, number:2010.0, text:'MICS']
93 [text:'Somalia', number:49.0, empty:'', number:44.5, number:53.6, number:36.1, number:56.6, number:62.1, number:59.9, number:50.7, number:39.0, number:31.5, number:2006.0, text:'MICS']
94 [text:'State of Palestine', number:5.7, empty:'', number:7.4, number:4.0, number:4.8, number:10.1, number:8.0, number:5.2, number:5.2, number:5.2, number:4.8, number:2010.0, text:'MICS']
95 [text:'Suriname', number:4.1, empty:'', number:4.1, number:4.1, number:2.5, number:6.9, number:7.9, number:2.7, number:3.5, number:2.1, number:1.6, number:2010.0, text:'MICS']
96 [text:'Swaziland', number:7.3, empty:'', number:7.7, number:6.9, number:6.6, number:7.5, number:9.9, number:6.9, number:8.1, number:5.4, number:5.2, number:2010.0, text:'MICS']
97 [text:'Syrian Arab Republic', number:4.0, empty:'', number:5.0, number:3.0, number:2.6, number:5.5, number:6.7, number:5.2, number:3.3, number:2.9, number:1.6, number:2006.0, text:'MICS']
98 [text:'Tajikistan', number:10.0, empty:'', number:9.4, number:10.6, number:8.1, number:10.6, number:13.6, number:12.2, number:9.0, number:8.0, number:6.0, number:2005.0, text:'MICS']
99 [text:'Thailand', number:8.3, empty:'', number:8.3, number:8.2, number:8.0, number:8.4, number:8.6, number:8.5, number:9.0, number:8.1, number:7.0, number:2006.0, text:'MICS']
100 [text:'The former Yugoslav Republic of Macedonia', number:12.5, empty:'', number:12.1, number:13.0, number:8.4, number:16.8, number:20.4, number:12.5, number:14.4, number:8.0, number:6.6, number:2011.0, text:'MICS']
101 [text:'Timor-Leste', number:4.2, empty:'', number:4.1, number:4.4, text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', text:'-', number:2002.0, text:'MICS']
102 [text:'Togo', number:28.3, empty:'', number:27.7, number:28.9, number:18.3, number:32.7, number:35.1, number:31.6, number:32.7, number:18.8, number:17.5, number:2010.0, text:'MICS']
103 [text:'Trinidad and Tobago', number:0.7, empty:'', number:0.7, number:0.6, text:'-', text:'-', number:1.2, number:0.6, number:0.9, number:0.4, number:0.0, number:2006.0, text:'MICS']
104 [text:'Tunisia', number:2.1, empty:'', number:2.6, number:1.6, number:1.5, number:3.3, number:2.7, number:2.6, number:1.1, number:1.5, number:2.6, text:'2011-2012', text:'MICS']
105 [text:'Turkey', number:5.9, text:'y', number:7.9, number:3.7, number:3.9, number:9.7, text:'-', text:'-', text:'-', text:'-', text:'-', number:2012.0, text:'Child Labour Force Survey']

In [58]:
# first, get the titles of our columns. 
title_rows=zip(sheet.row_values(4),sheet.row_values(5))
print(title_rows)

<zip object at 0x000001B68A4ED988>

# Summarizing, Aggregating, and Grouping

In [63]:
import dateutil
data=pd.read_csv('phone_data.csv')
data.head()

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

In [64]:
data['date'] = data['date'].apply(dateutil.parser.parse, dayfirst=True)

In [65]:
data['month'].value_counts()

2014-11    230
2015-01    205
2014-12    157
2015-02    137
2015-03    101
Name: month, dtype: int64

In [67]:
data['network'].nunique()

9

In [68]:
data.groupby(['month']).groups.keys()

dict_keys(['2014-11', '2014-12', '2015-01', '2015-02', '2015-03'])

In [70]:
len(data.groupby(['month']).groups['2014-11'])

230

In [74]:
data.groupby(['month'])['date'].count()

month
2014-11    230
2014-12    157
2015-01    205
2015-02    137
2015-03    101
Name: date, dtype: int64

In [75]:
data[data['item']=='call'].groupby('network')['duration'].sum()

network
Meteor        7200.0
Tesco        13828.0
Three        36464.0
Vodafone     14621.0
landline     18433.0
voicemail     1775.0
Name: duration, dtype: float64

In [76]:
#produces Pandas Series
data.groupby('month')['duration'].sum()

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [77]:
#produces Pandas DataFrame
data.groupby('month')[['duration']].sum()

          duration
month
2014-11  26639.441
2014-12  14641.870
2015-01  18223.299
2015-02  15522.299
2015-03  22750.441

In [82]:
data.groupby('month',as_index=False).agg({"duration":"sum"})
# Using the as_index parameter while Grouping data in pandas prevents setting
# a row index on the result.

     month   duration
0  2014-11  26639.441
1  2014-12  14641.870
2  2015-01  18223.299
3  2015-02  15522.299
4  2015-03  22750.441

Applying a single function to columns in groups

In [85]:
data.groupby(
['month','item']
).agg(
    {
        'duration':sum,
        'network_type': "count",
        'date': 'first'
    }
)

               duration  network_type                date
month   item
2014-11 call  25547.000           107 2014-10-15 06:58:00
        data    998.441            29 2014-10-15 06:58:00
        sms      94.000            94 2014-10-16 22:18:00
2014-12 call  13561.000            79 2014-11-14 17:24:00
        data   1032.870            30 2014-11-13 06:58:00
        sms      48.000            48 2014-11-14 17:28:00
2015-01 call  17070.000            88 2014-12-15 20:03:00
        data   1067.299            31 2014-12-13 06:58:00
        sms      86.000            86 2014-12-15 19:56:00
2015-02 call  14416.000            67 2015-01-15 10:36:00
        data   1067.299            31 2015-01-13 06:58:00
        sms      39.000            39 2015-01-15 12:23:00
2015-03 call  21727.000            47 2015-02-12 20:15:00
        data    998.441            29 2015-02-13 06:58:00
        sms      25.000            25 2015-02-19 18:46:00

In [105]:
data.groupby(
['month','item']
).agg(
    {
        'duration':sum,
        'network_type': "count",
        'date': 'first'
    }
).unstack() #unstack reduces the layers of the dataframe

        duration                 network_type                         date  \
item        call      data   sms         call data sms                call
month
2014-11  25547.0   998.441  94.0          107   29  94 2014-10-15 06:58:00
2014-12  13561.0  1032.870  48.0           79   30  48 2014-11-14 17:24:00
2015-01  17070.0  1067.299  86.0           88   31  86 2014-12-15 20:03:00
2015-02  14416.0  1067.299  39.0           67   31  39 2015-01-15 10:36:00
2015-03  21727.0   998.441  25.0           47   29  25 2015-02-12 20:15:00


item                   data                 sms
month
2014-11 2014-10-15 06:58:00 2014-10-16 22:18:00
2014-12 2014-11-13 06:58:00 2014-11-14 17:28:00
2015-01 2014-12-13 06:58:00 2014-12-15 19:56:00
2015-02 2015-01-13 06:58:00 2015-01-15 12:23:00
2015-03 2015-02-13 06:58:00 2015-02-19 18:46:00

Applying multiple functions to columns in groups

In [93]:
df1=data.groupby(
    ['month', 'item']
).agg(
    {
        # find the min, max, and sum of the duration column
        'duration': [min, max, sum],
         # find the number of network type entries
        'network_type': "count",
        # min, first, and number of unique dates per group
        'date': [min, 'first', 'nunique']
    }
)

Renaming grouped statistics from groupby operations

In [98]:
grouped = data.groupby('month').agg({"duration":[min, max, np.mean]})
grouped.head()

        duration
             min      max        mean
month
2014-11      1.0   1940.0  115.823657
2014-12      1.0   2120.0   93.260318
2015-01      1.0   1859.0   88.894141
2015-02      1.0   1863.0  113.301453
2015-03      1.0  10528.0  225.251891

In [99]:
grouped.columns = grouped.columns.droplevel(level=0)
grouped.rename(columns={
    "min": "min_duration", "max": "max_duration", "mean": "mean_duration"
})
grouped.head()

         min      max        mean
month
2014-11  1.0   1940.0  115.823657
2014-12  1.0   2120.0   93.260318
2015-01  1.0   1859.0   88.894141
2015-02  1.0   1863.0  113.301453
2015-03  1.0  10528.0  225.251891

In [102]:
data.describe()

            index      duration
count  830.000000    830.000000
mean   414.500000    117.804036
std    239.744656    444.129560
min      0.000000      1.000000
25%    207.250000      1.000000
50%    414.500000     24.500000
75%    621.750000     55.000000
max    829.000000  10528.000000

Creating bins

In [104]:
bins=[0,3000,6000,9000,12000]
group_names=['low','medium','long','very long']
data['categories']=pd.cut(data['duration'],bins,labels=group_names)

,index,date,duration,item,month,network,network_type,categories
0,0,2014-10-15 06:58:00,34.429,data,2014-11,data,data,low
1,1,2014-10-15 06:58:00,13.000,call,2014-11,Vodafone,mobile,low
2,2,2014-10-15 14:46:00,23.000,call,2014-11,Meteor,mobile,low
3,3,2014-10-15 14:48:00,4.000,call,2014-11,Tesco,mobile,low
4,4,2014-10-15 17:27:00,4.000,call,2014-11,Tesco,mobile,low
...,...,...,...,...,...,...,...,...
825,825,2015-03-13 00:38:00,1.000,sms,2015-03,world,world,low
826,826,2015-03-13 00:39:00,1.000,sms,2015-03,Vodafone,mobile,low
827,827,2015-03-13 06:58:00,34.429,data,2015-03,data,data,low
828,828,2015-03-14 00:13:00,1.000,sms,2015-03,world,world,low
829,829,2015-03-14 00:16:00,1.000,sms,2015-03,world,world,low

# Split-Apply-Combine

In [107]:
def ranker(df):
    ###Assigns a rank to each entry based on duration
    ###Assuming the data is DESC sorted.
    df['within_network_duration']=np.arange(len(df))+1
    return df
data.sort_values('duration',ascending=False,inplace=True)
data=data.groupby(['network']).apply(ranker)
print(data[data.within_network_duration==1].head(7))

     index                date   duration  item    month    network  \
816    816 2015-03-04 12:29:00  10528.000  call  2015-03   landline
742    742 2015-02-17 19:09:00   2328.000  call  2015-03      Three
398    398 2014-12-17 18:08:00   1859.000  call  2015-01   Vodafone
105    105 2014-10-31 13:27:00   1234.000  call  2014-11      Tesco
632    632 2015-01-21 19:38:00   1090.000  call  2015-02     Meteor
298    298 2014-11-25 18:47:00    174.000  call  2014-12  voicemail
397    397 2014-12-17 06:58:00     34.429  data  2015-01       data

    network_type categories  within_network_duration
816     landline  very long                        1
742       mobile        low                        1
398       mobile        low                        1
105       mobile        low                        1
632       mobile        low                        1
298    voicemail        low                        1
397         data        low                        1